<<<<<<< HEAD
# ñîçäàåì ôàéë êîíôèãóğàöèè cfg_token.py è ïîìåùàåì òóäà êëş÷è ÿíäåêñà è òåëåãè
## òîêåí ÒÃ
telebot_token ='òóò àáğàêàäàáğà îò ÒÃ'
## òîêåí ßÄ
ya_dsk_token = 'òóò àáğàêàäàáğà îò ßÄ'
=======
# ÑĞ¾Ğ·Ğ´Ğ°ĞµĞ¼ Ñ„Ğ°Ğ¹Ğ» ĞºĞ¾Ğ½Ñ„Ğ¸Ğ³ÑƒÑ€Ğ°Ñ†Ğ¸Ğ¸ cfg_token.py Ğ¸ Ğ¿Ğ¾Ğ¼ĞµÑ‰Ğ°ĞµĞ¼ Ñ‚ÑƒĞ´Ğ° ĞºĞ»ÑÑ‡Ğ¸ ÑĞ½Ğ´ĞµĞºÑĞ° Ğ¸ Ñ‚ĞµĞ»ĞµĞ³Ğ¸
## Ñ‚Ğ¾ĞºĞµĞ½ Ğ¢Ğ“
telebot_token ='Ñ‚ÑƒÑ‚ Ğ°Ğ±Ñ€Ğ°ĞºĞ°Ğ´Ğ°Ğ±Ñ€Ğ° Ğ¾Ñ‚ Ğ¢Ğ“'
## Ñ‚Ğ¾ĞºĞµĞ½ Ğ¯Ğ”
ya_dsk_token = 'Ñ‚ÑƒÑ‚ Ğ°Ğ±Ñ€Ğ°ĞºĞ°Ğ´Ğ°Ğ±Ñ€Ğ° Ğ¾Ñ‚ Ğ¯Ğ”'
>>>>>>> 5c39f649394f144af54e86d1663d6d480dab1841
